{
  "Apps Built with VeChain Kit": "Apps, die mit dem VeChain Kit erstellt wurden",
  "Are there any limitations?": "Gibt es irgendwelche Einschränkungen?",
  "Boosted Development": "Beschleunigte Entwicklung",
  "Build on VeChain, effortlessly": "Erstellen Sie mühelos auf VeChain",
  "By developers, for developers.": "Von Entwicklern, für Entwickler.",
  "Can I customize the login methods shown to users?": "Kann ich die den Nutzern angezeigten Login-Methoden anpassen?",
  "Choose from a wide variety of login methods to suit your users' preferences. Support for VeWorld, WalletConnect, social logins (Google, Apple, Twitter, GitHub), passkeys, and more. Give your users the flexibility they need.": "Wählen Sie aus einer Vielzahl von Login-Methoden, die den Vorlieben Ihrer Nutzer entsprechen. Unterstützung für VeWorld, WalletConnect, Social Logins (Google, Apple, Twitter, GitHub), Passkeys und mehr. Geben Sie Ihren Nutzern die gewünschte Flexibilität.",
  "Color, fonts, background color, etc. You can create your own login button, and modal or use the provided one. You can decide to show or not the wallet or transaction modal, or show only specific contents (Send, Receive, Assets, Profile, etc.).": "Farbe, Schriftarten, Hintergrundfarbe usw. Sie können Ihren eigenen Login-Button und Ihr eigenes Modal erstellen oder das bereitgestellte verwenden. Sie können entscheiden, ob das Wallet- oder Transaktions-Modal angezeigt wird oder nicht, oder nur bestimmte Inhalte anzeigen (Senden, Empfangen, Vermögenswerte, Profil usw.).",
  "Customizable": "Anpassbar",
  "DAO": "DAO",
  "DeFi": "DeFi",
  "Demo text to be translated": "Demo-Text zum Übersetzen",
  "Discover all the possible ways to use the VeChain Kit to build your next dApp.": "Entdecken Sie alle Möglichkeiten, wie Sie das VeChain Kit für Ihre nächste dApp nutzen können.",
  "Energy": "Energie",
  "Forget about the underlying blockchain infrastructure. We handle it for you.": "Vergessen Sie die zugrunde liegende Blockchain-Infrastruktur. Wir kümmern uns darum für Sie.",
  "Frequently Asked Questions": "Häufig gestellte Fragen",
  "Gaming": "Gaming",
  "Get Started Now": "Jetzt starten",
  "Is the kit free to use?": "Ist das Kit kostenlos nutzbar?",
  "Lightweight integration to allow social login users to use the platform and manage their energy assets.": "Leichte Integration, damit sich Nutzer mit Social Login anmelden und ihre Energie-Assets auf der Plattform verwalten können.",
  "Login Methods": "Anmeldemethoden",
  "Login methods": "Anmeldemethoden",
  "Multi-language": "Mehrsprachig",
  "Multiple language support": "Unterstützung mehrerer Sprachen",
  "Out of the box": "Sofort einsetzbar",
  "Staking": "Staking",
  "Supports only VeWorld, WalletConnect, and Sync2 wallets, and fully integrates VeChain Kit UI into the app to enhance the user experience Profile and Wallet modals.": "Unterstützt nur VeWorld-, WalletConnect- und Sync2-Wallets und integriert das VeChain Kit UI vollständig in die App, um das Nutzererlebnis in Profil- und Walletmodals zu verbessern.",
  "Sustainability": "Nachhaltigkeit",
  "The VeChain Kit is a fantastic foundation for building on VeChain, especially with its clean hooks and UI components.": "Das VeChain Kit ist eine großartige Grundlage für das Bauen auf VeChain, besonders durch die übersichtlichen Hooks und UI-Komponenten.",
  "The kit is designed to be customizable to your needs. Decide what features you want to use and which ones you don't. Add call-to-action buttons to your app to guide your users to the features they need.": "Das Kit ist darauf ausgelegt, an Ihre Bedürfnisse anpassbar zu sein. Entscheiden Sie selbst, welche Funktionen Sie nutzen möchten und welche nicht. Fügen Sie Ihrer App Call-to-Action-Buttons hinzu, um Ihre Nutzer gezielt zu den gewünschten Funktionen zu führen.",
  "The kit supports Next.js and React.": "Das Kit unterstützt Next.js und React.",
  "The kit supports multiple languages out of the box allowing bidirectional sync between the kit and the host app.": "Das Kit unterstützt mehrere Sprachen direkt und ermöglicht eine bidirektionale Synchronisierung zwischen dem Kit und der Host-App.",
  "The user pays for the transactions. However, if you want to sponsor them (always or only in specific scenarios), you can use the fee delegation feature.": "Der Nutzer zahlt für die Transaktionen. Wenn du diese jedoch (immer oder nur in bestimmten Szenarien) sponsern möchtest, kannst du die Gebührendelegationsfunktion nutzen.",
  "To support all login methods, you need to use the kit's own hooks (useSendTransaction and useSignMessage). To fully customize the login experience, you need to use your own Privy account. The VeChain shared Privy integration has some limitations: you cannot target only specific social login methods, you cannot fully customize the login UX (users will need to go through a popup window), and users' signatures are always requested when doing transactions.": "Um alle Login-Methoden zu unterstützen, musst du die eigenen Hooks des Kits (useSendTransaction und useSignMessage) nutzen. Um das Login-Erlebnis vollständig anzupassen, benötigst du einen eigenen Privy-Account. Die geteilte VeChain Privy-Integration hat einige Einschränkungen: Du kannst nicht nur bestimmte Social-Login-Methoden ansprechen, das Login-UX kann nicht vollständig angepasst werden (Nutzer müssen ein Popup-Fenster durchlaufen) und bei Transaktionen werden die Signaturen der Nutzer immer angefragt.",
  "Trading": "Trading",
  "Try me!": "Probier mich aus!",
  "Use our hooks and components to speed up your development and interact with the blockchain.": "Nutze unsere Hooks und Komponenten, um deine Entwicklung zu beschleunigen und mit der Blockchain zu interagieren.",
  "Uses VeChain Kit end-to-end: login, wallet, hooks, and transaction components.": "Verwendet VeChain Kit End-to-End: Login, Wallet, Hooks und Transaktionskomponenten.",
  "Uses VeChain Kit only for the login flow and for the hooks to manage transactions.": "Verwendet VeChain Kit nur für den Login-Flow und für die Hooks zur Verwaltung von Transaktionen.",
  "Uses VeChain Kit to allow social login users to trade on the platform.": "Verwendet VeChain Kit, um Nutzern mit Social Login das Trading auf der Plattform zu ermöglichen.",
  "Uses its own Privy setup for social login OAuth2 based methods like Google and Apple": "Verwendet eine eigene Privy-Konfiguration für Social-Login OAuth2-basierte Methoden wie Google und Apple",
  "Uses its own Privy setup for social login OAuth2 based methods like Google and Apple.": "Verwendet eine eigene Privy-Konfiguration für Social-Login OAuth2-basierte Methoden wie Google und Apple.",
  "VeChain Kit": "VeChain Kit",
  "VeChain Kit UI is fully integrated into the app, using a bottom sheet UX on mobile to enhance the user experience.": "VeChain Kit UI ist vollständig in die App integriert und verwendet auf Mobilgeräten ein Bottom-Sheet-UX, um das Nutzererlebnis zu verbessern.",
  "VeChain Kit is a toolkit for building applications on VeChain, supporting wallet integration, developer hooks, pre-built UI components, and more.": "VeChain Kit ist ein Toolkit zum Entwickeln von Anwendungen auf VeChain. Es unterstützt die Integration von Wallets, Entwickler-Hooks, vorgefertigte UI-Komponenten und mehr.",
  "VeChain Kit is an all-in-one SDK for building frontend applications on VeChain blockchain, supporting wallet integration, developer hooks, pre-built UI components, and more.": "VeChain Kit ist ein All-in-One-SDK für den Bau von Frontend-Anwendungen auf der VeChain-Blockchain und unterstützt Wallet-Integration, Entwickler-Hooks, vorgefertigte UI-Komponenten und mehr.",
  "Version 2 has been released!": "Version 2 wurde veröffentlicht!",
  "View Release Notes": "Release Notes anzeigen",
  "Visit": "Besuchen",
  "What are the limitations?": "Was sind die Einschränkungen?",
  "What are the supported frameworks?": "Welche Frameworks werden unterstützt?",
  "What can I customize?": "Was kann ich anpassen?",
  "Who pays for the transactions?": "Wer zahlt für die Transaktionen?",
  "Yes. VeChain Kit is free to use. If you want full control over the login experience, you can connect your own Privy account (Privy pricing applies). If you use the shared VeChain + Privy integration, you don't pay anything to get started.": "Ja. VeChain Kit ist kostenlos nutzbar. Wenn Sie die volle Kontrolle über das Login-Erlebnis haben möchten, können Sie Ihr eigenes Privy-Konto verbinden (Privy-Preise gelten). Wenn Sie die gemeinsame VeChain + Privy-Integration nutzen, zahlen Sie nichts, um loszulegen.",
  "Yes. You can decide to use only veworld, or only social login methods. To maximize flexibility, you can also use your own Privy account and connect it to VeChain Kit, allowing you to use OAuth2-based login methods like Google, Apple, Twitter, GitHub, etc. and completely customize the login experience.": "Ja. Sie können entscheiden, nur veworld oder nur soziale Login-Methoden zu verwenden. Um maximale Flexibilität zu erreichen, können Sie auch Ihr eigenes Privy-Konto verwenden und es mit VeChain Kit verbinden, sodass Sie OAuth2-basierte Login-Methoden wie Google, Apple, Twitter, GitHub usw. nutzen und das Login-Erlebnis vollständig anpassen können.",
  "Yes. You need to use the kit's own hooks (useSendTransaction and useSignMessage) to support all login methods. And, to fully customize the login experience, you need to open your own Privy account, since with the shared VeChain + Privy integration you cannot target only specific social login methods and users' signatures are always requested when doing transactions.": "Ja. Sie müssen die eigenen Hooks des Kits (useSendTransaction und useSignMessage) verwenden, um alle Login-Methoden zu unterstützen. Und um das Login-Erlebnis vollständig anzupassen, müssen Sie Ihr eigenes Privy-Konto eröffnen, da Sie mit der gemeinsamen VeChain + Privy-Integration nicht nur bestimmte soziale Login-Methoden auswählen können und die Signaturen der Nutzer bei Transaktionen immer angefordert werden.",
  "and more...": "und mehr..."
}