{
  "Apps Built with VeChain Kit": "Apps, die mit dem VeChain Kit entwickelt wurden",
  "Boosted Development": "Beschleunigte Entwicklung",
  "Build on VeChain, effortlessly": "Baue mühelos auf VeChain",
  "By developers, for developers.": "Von Entwicklern, für Entwickler.",
  "Can I customize the login methods shown to users?": "Kann ich die den Nutzern angezeigten Login-Methoden anpassen?",
  "Choose from a wide variety of login methods to suit your users' preferences. Support for VeWorld, WalletConnect, social logins (Google, Apple, Twitter, GitHub), passkeys, and more. Give your users the flexibility they need.": "Wählen Sie aus einer Vielzahl von Login-Methoden, passend zu den Vorlieben Ihrer Nutzer. Unterstützung für VeWorld, WalletConnect, Social Logins (Google, Apple, Twitter, GitHub), Passkeys und mehr. Geben Sie Ihren Nutzern die Flexibilität, die sie brauchen.",
  "Color, fonts, background color, etc. You can create your own login button, and modal or use the provided one. You can decide to show or not the wallet or transaction modal, or show only specific contents (Send, Receive, Assets, Profile, etc.).": "Farbe, Schriftarten, Hintergrundfarbe usw. Sie können Ihren eigenen Login-Button und Ihr eigenes Modal erstellen oder die bereitgestellten verwenden. Sie können entscheiden, ob Sie das Wallet- oder Transaktions-Modal anzeigen möchten oder nur bestimmte Inhalte (Senden, Empfangen, Vermögenswerte, Profil, usw.) zeigen.",
  "Customizable": "Anpassbar",
  "DAO": "DAO",
  "DeFi": "DeFi",
  "Demo text to be translated": "Zu übersetzender Demotext",
  "Discover all the possible ways to use the VeChain Kit to build your next dApp.": "Entdecken Sie alle Möglichkeiten, das VeChain Kit für den Bau Ihrer nächsten dApp zu nutzen.",
  "Energy": "Energie",
  "Forget about the underlying blockchain infrastructure. We handle it for you.": "Vergessen Sie die zugrundeliegende Blockchain-Infrastruktur. Wir kümmern uns darum.",
  "Frequently Asked Questions": "Häufig gestellte Fragen",
  "Gaming": "Gaming",
  "Get Started Now": "Jetzt loslegen",
  "Is the kit free to use?": "Ist das Kit kostenlos nutzbar?",
  "Login Methods": "Login-Methoden",
  "Login methods": "Login-Methoden",
  "Multi-language": "Mehrsprachig",
  "Multiple language support": "Unterstützung mehrerer Sprachen",
  "Out of the box": "Sofort einsetzbar",
  "Staking": "Staking",
  "Sustainability": "Nachhaltigkeit",
  "The VeChain Kit is a fantastic foundation for building on VeChain, especially with its clean hooks and UI components.": "Das VeChain Kit ist eine großartige Grundlage für die Entwicklung auf VeChain, insbesondere durch seine klaren Hooks und UI-Komponenten.",
  "The kit is designed to be customizable to your needs. Decide what features you want to use and which ones you don't. Add call-to-action buttons to your app to guide your users to the features they need.": "Das Kit ist so konzipiert, dass es individuell an Ihre Bedürfnisse angepasst werden kann. Entscheiden Sie, welche Funktionen Sie nutzen möchten und welche nicht. Fügen Sie Ihrer App Call-to-Action-Buttons hinzu, um Ihre Nutzer zu den benötigten Funktionen zu führen.",
  "The kit supports Next.js and React.": "Das Kit unterstützt Next.js und React.",
  "The kit supports multiple languages out of the box allowing bidirectional sync between the kit and the host app.": "Das Kit unterstützt mehrere Sprachen direkt und ermöglicht eine bidirektionale Synchronisation zwischen dem Kit und der Host-Anwendung.",
  "The user pays for the transactions. However, if you want to sponsor them (always or only in specific scenarios), you can use the fee delegation feature.": "Der Benutzer zahlt für die Transaktionen. Wenn Sie diese jedoch sponsern möchten (immer oder nur in bestimmten Szenarien), können Sie die Gebühren-Delegationsfunktion nutzen.",
  "To support all login methods, you need to use the kit's own hooks (useSendTransaction and useSignMessage). To fully customize the login experience, you need to use your own Privy account. The VeChain shared Privy integration has some limitations: you cannot target only specific social login methods, you cannot fully customize the login UX (users will need to go through a popup window), and users' signatures are always requested when doing transactions.": "Um alle Login-Methoden zu unterstützen, müssen Sie die eigenen Hooks des Kits (useSendTransaction und useSignMessage) verwenden. Für eine komplett individuelle Login-Erfahrung müssen Sie Ihr eigenes Privy-Konto nutzen. Die gemeinsame Privy-Integration von VeChain hat einige Einschränkungen: Sie können keine einzelnen Social-Login-Methoden gezielt ansprechen, das Login-UX nicht vollständig anpassen (Nutzer müssen ein Popup-Fenster durchlaufen) und die Signaturen der Nutzer werden bei Transaktionen immer angefordert.",
  "Trading": "Handel",
  "Use our hooks and components to speed up your development and interact with the blockchain.": "Nutzen Sie unsere Hooks und Komponenten, um Ihre Entwicklung zu beschleunigen und mit der Blockchain zu interagieren.",
  "VeChain Kit": "VeChain Kit",
  "VeChain Kit is an all-in-one SDK for building frontend applications on VeChain blockchain, supporting wallet integration, developer hooks, pre-built UI components, and more.": "VeChain Kit ist ein All-in-One-SDK zum Erstellen von Frontend-Anwendungen auf der VeChain-Blockchain. Es unterstützt Wallet-Integration, Entwickler-Hooks, vorgefertigte UI-Komponenten und mehr.",
  "Version 2 has been released!": "Version 2 wurde veröffentlicht!",
  "View Release Notes": "Versionshinweise anzeigen",
  "Visit": "Besuchen",
  "What are the limitations?": "Was sind die Einschränkungen?",
  "What are the supported frameworks?": "Welche Frameworks werden unterstützt?",
  "What can I customize?": "Was kann ich anpassen?",
  "Who pays for the transactions?": "Wer bezahlt die Transaktionen?",
  "Yes. VeChain Kit is free to use. If you want full control over the login experience, you can connect your own Privy account (Privy pricing applies). If you use the shared VeChain + Privy integration, you don't pay anything to get started.": "Ja. VeChain Kit ist kostenlos nutzbar. Wenn Sie die volle Kontrolle über das Login-Erlebnis haben möchten, können Sie Ihr eigenes Privy-Konto verbinden (es gelten die Preise von Privy). Wenn Sie die gemeinsame VeChain + Privy-Integration verwenden, zahlen Sie nichts, um zu starten.",
  "Yes. You can decide to use only veworld, or only social login methods. To maximize flexibility, you can also use your own Privy account and connect it to VeChain Kit, allowing you to use OAuth2-based login methods like Google, Apple, Twitter, GitHub, etc. and completely customize the login experience.": "Ja. Sie können entscheiden, nur veworld oder nur soziale Login-Methoden zu verwenden. Für maximale Flexibilität können Sie auch Ihr eigenes Privy-Konto nutzen und es mit VeChain Kit verbinden, sodass Sie OAuth2-basierte Login-Methoden wie Google, Apple, Twitter, GitHub usw. verwenden und das Login-Erlebnis vollständig anpassen können.",
  "and more...": "und mehr...",
  "• Lightweight integration for social login.\n• Uses the login and wallet modals.": "• Leichte Integration für Social Login.\n• Verwendet die Login- und Wallet-Dialoge.",
  "• Supports VeWorld, WalletConnect, and Sync2 wallets (only).\n• VeChain Kit UI is fully integrated into the app.\n• Uses VeChain Kit hooks for transaction management.\n• Uses custom transaction flows and components.": "• Unterstützt nur VeWorld-, WalletConnect- und Sync2-Wallets.\n• VeChain Kit UI ist vollständig in die App integriert.\n• Verwendet VeChain Kit Hooks für das Transaktionsmanagement.\n• Verwendet benutzerdefinierte Transaktionsabläufe und Komponenten.",
  "• Supports all login methods.\n• Uses the login and wallet modals.\n• Uses VeChain Kit hooks for transaction management.\n• Uses custom transaction flows and components.": "• Unterstützt alle Login-Methoden.\n• Verwendet die Login- und Wallet-Dialoge.\n• Verwendet VeChain Kit Hooks für das Transaktionsmanagement.\n• Verwendet benutzerdefinierte Transaktionsabläufe und Komponenten.",
  "• Supports all login methods.\n• VeChain Kit UI is fully integrated into the app.\n• Uses a bottom sheet UX on mobile.\n• Uses VeChain Kit hooks for transaction management.\n• Uses custom transaction flows and components.": "• Unterstützt alle Login-Methoden.\n• VeChain Kit UI ist vollständig in die App integriert.\n• Verwendet eine Bottom-Sheet-UX auf Mobilgeräten.\n• Verwendet VeChain Kit Hooks für das Transaktionsmanagement.\n• Verwendet benutzerdefinierte Transaktionsabläufe und Komponenten.",
  "• Uses VeChain Kit UI only for the \"Login\" screen.\n• Uses VeChain Kit hooks.": "• Verwendet VeChain Kit UI nur für den \"Login\"-Bildschirm.\n• Verwendet VeChain Kit Hooks.",
  "• Uses VeChain Kit end-to-end: login, wallet, hooks, and transaction components.": "• Nutzt VeChain Kit End-to-End: Login, Wallet, Hooks und Transaktionskomponenten.",
  "• Uses its own Privy setup.\n• Supports Google OAuth login and VeWorld login.\n• Implements custom login, wallet management, and transaction flows (no VeChain Kit UI).\n• Uses VeChain Kit UI only for the \"Receive\" and \"Send\" screens.\n• Uses VeChain Kit hooks for transaction management.": "• Verwendet eigenes Privy-Setup.\n• Unterstützt Google OAuth-Login und VeWorld-Login.\n• Implementiert benutzerdefiniertes Login, Wallet-Management und Transaktionsabläufe (keine VeChain Kit UI).\n• Verwendet VeChain Kit UI nur für die Bildschirme \"Empfangen\" und \"Senden\".\n• Verwendet VeChain Kit Hooks für das Transaktionsmanagement."
}