{
  "Apps Built with VeChain Kit": "Aplicaciones creadas con VeChain Kit",
  "Boosted Development": "Desarrollo Potenciado",
  "Build on VeChain, effortlessly": "Construye en VeChain, sin esfuerzo",
  "By developers, for developers.": "Por desarrolladores, para desarrolladores.",
  "Can I customize the login methods shown to users?": "¿Puedo personalizar los métodos de inicio de sesión que se muestran a los usuarios?",
  "Choose from a wide variety of login methods to suit your users' preferences. Support for VeWorld, WalletConnect, social logins (Google, Apple, Twitter, GitHub), passkeys, and more. Give your users the flexibility they need.": "Elige entre una amplia variedad de métodos de acceso para adaptarte a las preferencias de tus usuarios. Compatible con VeWorld, WalletConnect, inicios de sesión sociales (Google, Apple, Twitter, GitHub), claves de acceso y más. Brinda a tus usuarios la flexibilidad que necesitan.",
  "Color, fonts, background color, etc. You can create your own login button, and modal or use the provided one. You can decide to show or not the wallet or transaction modal, or show only specific contents (Send, Receive, Assets, Profile, etc.).": "Color, fuentes, color de fondo, etc. Puedes crear tu propio botón de inicio de sesión y modal, o usar el proporcionado. Puedes decidir mostrar o no el modal de billetera o transacción, o mostrar solo contenidos específicos (Enviar, Recibir, Activos, Perfil, etc.).",
  "Customizable": "Personalizable",
  "DAO": "DAO",
  "DeFi": "DeFi",
  "Demo text to be translated": "Texto de demostración para ser traducido",
  "Discover all the possible ways to use the VeChain Kit to build your next dApp.": "Descubre todas las formas posibles de usar VeChain Kit para crear tu próxima dApp.",
  "Energy": "Energía",
  "Forget about the underlying blockchain infrastructure. We handle it for you.": "Olvídate de la infraestructura blockchain subyacente. Nosotros nos encargamos por ti.",
  "Frequently Asked Questions": "Preguntas Frecuentes",
  "Gaming": "Juegos",
  "Get Started Now": "Comienza Ahora",
  "Is the kit free to use?": "¿El kit es gratuito?",
  "Login Methods": "Métodos de Inicio de Sesión",
  "Login methods": "Métodos de inicio de sesión",
  "Multi-language": "Multi-idioma",
  "Multiple language support": "Soporte para múltiples idiomas",
  "Out of the box": "Listo para usar",
  "Staking": "Staking",
  "Sustainability": "Sostenibilidad",
  "The VeChain Kit is a fantastic foundation for building on VeChain, especially with its clean hooks and UI components.": "VeChain Kit es una base fantástica para desarrollar en VeChain, especialmente por sus hooks limpios y componentes de interfaz de usuario.",
  "The kit is designed to be customizable to your needs. Decide what features you want to use and which ones you don't. Add call-to-action buttons to your app to guide your users to the features they need.": "El kit está diseñado para ser personalizable según tus necesidades. Decide qué funciones deseas utilizar y cuáles no. Agrega botones de llamada a la acción a tu aplicación para guiar a tus usuarios hacia las características que requieren.",
  "The kit supports Next.js and React.": "El kit es compatible con Next.js y React.",
  "The kit supports multiple languages out of the box allowing bidirectional sync between the kit and the host app.": "El kit soporta múltiples idiomas de forma nativa, permitiendo la sincronización bidireccional entre el kit y la aplicación anfitriona.",
  "The user pays for the transactions. However, if you want to sponsor them (always or only in specific scenarios), you can use the fee delegation feature.": "El usuario paga por las transacciones. Sin embargo, si deseas patrocinarlas (siempre o solo en escenarios específicos), puedes utilizar la función de delegación de tarifas.",
  "To support all login methods, you need to use the kit's own hooks (useSendTransaction and useSignMessage). To fully customize the login experience, you need to use your own Privy account. The VeChain shared Privy integration has some limitations: you cannot target only specific social login methods, you cannot fully customize the login UX (users will need to go through a popup window), and users' signatures are always requested when doing transactions.": "Para soportar todos los métodos de inicio de sesión, necesitas usar los hooks propios del kit (useSendTransaction y useSignMessage). Para personalizar completamente la experiencia de inicio de sesión, necesitas usar tu propia cuenta de Privy. La integración compartida de Privy de VeChain tiene algunas limitaciones: no puedes limitarte solo a métodos de inicio de sesión social específicos, no puedes personalizar completamente la experiencia de usuario de inicio de sesión (los usuarios deberán pasar por una ventana emergente), y siempre se solicitarán las firmas de los usuarios al realizar transacciones.",
  "Trading": "Comercio",
  "Use our hooks and components to speed up your development and interact with the blockchain.": "Utiliza nuestros hooks y componentes para acelerar tu desarrollo e interactuar con la blockchain.",
  "VeChain Kit": "VeChain Kit",
  "VeChain Kit is an all-in-one SDK for building frontend applications on VeChain blockchain, supporting wallet integration, developer hooks, pre-built UI components, and more.": "VeChain Kit es un SDK todo-en-uno para desarrollar aplicaciones frontend en la blockchain de VeChain, con integración de billeteras, hooks para desarrolladores, componentes de interfaz preconstruidos y más.",
  "Version 2 has been released!": "¡La versión 2 ha sido lanzada!",
  "View Release Notes": "Ver notas de lanzamiento",
  "Visit": "Visitar",
  "What are the limitations?": "¿Cuáles son las limitaciones?",
  "What are the supported frameworks?": "¿Cuáles son los frameworks compatibles?",
  "What can I customize?": "¿Qué puedo personalizar?",
  "Who pays for the transactions?": "¿Quién paga las transacciones?",
  "Yes. VeChain Kit is free to use. If you want full control over the login experience, you can connect your own Privy account (Privy pricing applies). If you use the shared VeChain + Privy integration, you don't pay anything to get started.": "Sí. VeChain Kit es gratuito. Si quieres tener control total sobre la experiencia de inicio de sesión, puedes conectar tu propia cuenta de Privy (se aplican los precios de Privy). Si utilizas la integración compartida de VeChain + Privy, no pagas nada para comenzar.",
  "Yes. You can decide to use only veworld, or only social login methods. To maximize flexibility, you can also use your own Privy account and connect it to VeChain Kit, allowing you to use OAuth2-based login methods like Google, Apple, Twitter, GitHub, etc. and completely customize the login experience.": "Sí. Puedes decidir usar solo veworld o solo métodos de inicio de sesión social. Para maximizar la flexibilidad, también puedes usar tu propia cuenta de Privy y conectarla a VeChain Kit, lo que te permitirá usar métodos de inicio de sesión basados en OAuth2 como Google, Apple, Twitter, GitHub, etc., y personalizar completamente la experiencia de inicio de sesión.",
  "and more...": "y más...",
  "• Lightweight integration for social login.\n• Uses the login and wallet modals.": "• Integración ligera para inicio de sesión social.\n• Utiliza los modales de inicio de sesión y cartera.",
  "• Supports VeWorld, WalletConnect, and Sync2 wallets (only).\n• VeChain Kit UI is fully integrated into the app.\n• Uses VeChain Kit hooks for transaction management.\n• Uses custom transaction flows and components.": "• Compatible únicamente con las carteras VeWorld, WalletConnect y Sync2.\n• La interfaz de VeChain Kit está totalmente integrada en la aplicación.\n• Utiliza hooks de VeChain Kit para la gestión de transacciones.\n• Utiliza flujos y componentes de transacciones personalizados.",
  "• Supports all login methods.\n• Uses the login and wallet modals.\n• Uses VeChain Kit hooks for transaction management.\n• Uses custom transaction flows and components.": "• Compatible con todos los métodos de inicio de sesión.\n• Utiliza los modales de inicio de sesión y cartera.\n• Utiliza hooks de VeChain Kit para la gestión de transacciones.\n• Utiliza flujos y componentes de transacciones personalizados.",
  "• Supports all login methods.\n• VeChain Kit UI is fully integrated into the app.\n• Uses a bottom sheet UX on mobile.\n• Uses VeChain Kit hooks for transaction management.\n• Uses custom transaction flows and components.": "• Compatible con todos los métodos de inicio de sesión.\n• La interfaz de VeChain Kit está totalmente integrada en la aplicación.\n• Utiliza una experiencia de usuario de hoja inferior en dispositivos móviles.\n• Utiliza hooks de VeChain Kit para la gestión de transacciones.\n• Utiliza flujos y componentes de transacciones personalizados.",
  "• Uses VeChain Kit UI only for the \"Login\" screen.\n• Uses VeChain Kit hooks.": "• Utiliza la interfaz de VeChain Kit solo para la pantalla de \"Inicio de sesión\".\n• Utiliza hooks de VeChain Kit.",
  "• Uses VeChain Kit end-to-end: login, wallet, hooks, and transaction components.": "• Utiliza VeChain Kit de extremo a extremo: inicio de sesión, cartera, hooks y componentes de transacciones.",
  "• Uses its own Privy setup.\n• Supports Google OAuth login and VeWorld login.\n• Implements custom login, wallet management, and transaction flows (no VeChain Kit UI).\n• Uses VeChain Kit UI only for the \"Receive\" and \"Send\" screens.\n• Uses VeChain Kit hooks for transaction management.": "• Utiliza su propia configuración de Privy.\n• Compatible con inicio de sesión mediante Google OAuth y VeWorld.\n• Implementa inicio de sesión, gestión de cartera y flujos de transacciones personalizados (sin la interfaz de VeChain Kit).\n• Utiliza la interfaz de VeChain Kit solo para las pantallas de \"Recibir\" y \"Enviar\".\n• Utiliza hooks de VeChain Kit para la gestión de transacciones."
}