{
    "Apps Built with VeChain Kit": "Aplicaciones creadas con VeChain Kit",
    "Are there any limitations?": "¿Existen limitaciones?",
    "Boosted Development": "Desarrollo acelerado",
    "Build on VeChain, effortlessly": "Construye sobre VeChain, sin esfuerzo",
    "By developers, for developers.": "Por desarrolladores, para desarrolladores.",
    "Can I customize the login methods shown to users?": "¿Puedo personalizar los métodos de inicio de sesión que se muestran a los usuarios?",
    "Choose from a wide variety of login methods to suit your users' preferences. Support for VeWorld, WalletConnect, social logins (Google, Apple, Twitter, GitHub), passkeys, and more. Give your users the flexibility they need.": "Elige entre una amplia variedad de métodos de inicio de sesión para adaptarte a las preferencias de tus usuarios. Soporte para VeWorld, WalletConnect, inicios de sesión sociales (Google, Apple, Twitter, GitHub), llaves de acceso y más. Da a tus usuarios la flexibilidad que necesitan.",
    "Color, fonts, background color, etc. You can create your own login button, and modal or use the provided one. You can decide to show or not the wallet or transaction modal, or show only specific contents (Send, Receive, Assets, Profile, etc.).": "Color, fuentes, color de fondo, etc. Puedes crear tu propio botón y modal de inicio de sesión o usar el que se proporciona. Puedes decidir mostrar o no el modal de billetera o de transacciones, o mostrar solo contenidos específicos (Enviar, Recibir, Activos, Perfil, etc.).",
    "Customizable": "Personalizable",
    "DAO": "DAO",
    "DeFi": "DeFi",
    "Demo text to be translated": "Texto de demostración para traducir",
    "Discover all the possible ways to use the VeChain Kit to build your next dApp.": "Descubre todas las formas posibles de utilizar VeChain Kit para construir tu próxima dApp.",
    "Energy": "Energía",
    "Forget about the underlying blockchain infrastructure. We handle it for you.": "Olvídate de la infraestructura blockchain subyacente. Nosotros nos encargamos por ti.",
    "Frequently Asked Questions": "Preguntas Frecuentes",
    "Gaming": "Juegos",
    "Get Started Now": "Comienza ahora",
    "Is the kit free to use?": "¿El kit es gratuito?",
    "Lightweight integration to allow social login users to use the platform and manage their energy assets.": "Integración ligera para permitir que los usuarios de inicio de sesión social utilicen la plataforma y gestionen sus activos energéticos.",
    "Login Methods": "Métodos de inicio de sesión",
    "Login methods": "Métodos de inicio de sesión",
    "Multi-language": "Multi-idioma",
    "Multiple language support": "Soporte para múltiples idiomas",
    "Out of the box": "Listo para usar",
    "Staking": "staking",
    "Supports only VeWorld, WalletConnect, and Sync2 wallets, and fully integrates VeChain Kit UI into the app to enhance the user experience Profile and Wallet modals.": "Admite solo las billeteras VeWorld, WalletConnect y Sync2, y integra completamente la interfaz de VeChain Kit en la aplicación para mejorar la experiencia del usuario en los perfiles y los modales de billetera.",
    "Sustainability": "Sostenibilidad",
    "The VeChain Kit is a fantastic foundation for building on VeChain, especially with its clean hooks and UI components.": "El VeChain Kit es una base fantástica para construir sobre VeChain, especialmente por sus hooks limpios y componentes de interfaz.",
    "The kit is designed to be customizable to your needs. Decide what features you want to use and which ones you don't. Add call-to-action buttons to your app to guide your users to the features they need.": "El kit está diseñado para ser personalizable según tus necesidades. Decide qué funcionalidades quieres usar y cuáles no. Agrega botones de llamada a la acción en tu aplicación para guiar a tus usuarios a las funciones que necesiten.",
    "The kit supports Next.js and React.": "El kit es compatible con Next.js y React.",
    "The kit supports multiple languages out of the box allowing bidirectional sync between the kit and the host app.": "El kit admite varios idiomas de forma nativa, lo que permite la sincronización bidireccional entre el kit y la aplicación anfitriona.",
    "The user pays for the transactions. However, if you want to sponsor them (always or only in specific scenarios), you can use the fee delegation feature.": "El usuario paga por las transacciones. Sin embargo, si quieres patrocinarlas (siempre o solo en escenarios específicos), puedes utilizar la función de delegación de tarifas.",
    "To support all login methods, you need to use the kit's own hooks (useSendTransaction and useSignMessage). To fully customize the login experience, you need to use your own Privy account. The VeChain shared Privy integration has some limitations: you cannot target only specific social login methods, you cannot fully customize the login UX (users will need to go through a popup window), and users' signatures are always requested when doing transactions.": "Para admitir todos los métodos de inicio de sesión, debes utilizar los hooks propios del kit (useSendTransaction y useSignMessage). Para personalizar completamente la experiencia de inicio de sesión, necesitas usar tu propia cuenta de Privy. La integración compartida de Privy de VeChain tiene algunas limitaciones: no puedes dirigir solo métodos específicos de inicio de sesión social, no puedes personalizar completamente la experiencia de usuario de inicio de sesión (los usuarios tendrán que pasar por una ventana emergente) y siempre se solicita la firma de los usuarios al realizar transacciones.",
    "Trading": "Trading",
    "Try me!": "¡Pruébame!",
    "Use our hooks and components to speed up your development and interact with the blockchain.": "Utiliza nuestros hooks y componentes para acelerar tu desarrollo e interactuar con la blockchain.",
    "Uses VeChain Kit end-to-end: login, wallet, hooks, and transaction components.": "Utiliza VeChain Kit de forma integral: inicio de sesión, cartera, hooks y componentes de transacciones.",
    "Uses VeChain Kit only for the login flow and for the hooks to manage transactions.": "Utiliza VeChain Kit solo para el flujo de inicio de sesión y los hooks que gestionan las transacciones.",
    "Uses VeChain Kit to allow social login users to trade on the platform.": "Utiliza VeChain Kit para permitir a los usuarios con inicio de sesión social operar en la plataforma.",
    "Uses its own Privy setup for social login OAuth2 based methods like Google and Apple": "Utiliza su propia configuración de Privy para métodos de inicio de sesión social basados en OAuth2 como Google y Apple",
    "Uses its own Privy setup for social login OAuth2 based methods like Google and Apple.": "Utiliza su propia configuración de Privy para métodos de inicio de sesión social basados en OAuth2 como Google y Apple.",
    "VeChain Kit": "VeChain Kit",
    "VeChain Kit UI is fully integrated into the app, using a bottom sheet UX on mobile to enhance the user experience.": "La interfaz de VeChain Kit está completamente integrada en la aplicación, utilizando un UX de hoja inferior en móviles para mejorar la experiencia del usuario.",
    "VeChain Kit is a toolkit for building applications on VeChain, supporting wallet integration, developer hooks, pre-built UI components, and more.": "VeChain Kit es un conjunto de herramientas para crear aplicaciones en VeChain, que admite la integración de billeteras, hooks para desarrolladores, componentes de interfaz preconstruidos y más.",
    "VeChain Kit is an all-in-one SDK for building frontend applications on VeChain blockchain, supporting wallet integration, developer hooks, pre-built UI components, and more.": "VeChain Kit es un SDK todo en uno para construir aplicaciones frontend en la blockchain de VeChain, compatible con integración de cartera, hooks para desarrolladores, componentes de UI preconstruidos y más.",
    "Version 2 has been released!": "¡La versión 2 ha sido lanzada!",
    "View Release Notes": "Ver notas de la versión",
    "Visit": "Visitar",
    "What are the limitations?": "¿Cuáles son las limitaciones?",
    "What are the supported frameworks?": "¿Cuáles son los frameworks soportados?",
    "What can I customize?": "¿Qué puedo personalizar?",
    "Who pays for the transactions?": "¿Quién paga las transacciones?",
    "Yes. VeChain Kit is free to use. If you want full control over the login experience, you can connect your own Privy account (Privy pricing applies). If you use the shared VeChain + Privy integration, you don't pay anything to get started.": "Sí. VeChain Kit es gratuito para usar. Si quieres tener control total sobre la experiencia de inicio de sesión, puedes conectar tu propia cuenta de Privy (aplican precios de Privy). Si utilizas la integración compartida de VeChain + Privy, no pagas nada para comenzar.",
    "Yes. You can decide to use only veworld, or only social login methods. To maximize flexibility, you can also use your own Privy account and connect it to VeChain Kit, allowing you to use OAuth2-based login methods like Google, Apple, Twitter, GitHub, etc. and completely customize the login experience.": "Sí. Puedes decidir usar solo veworld o solo métodos de inicio de sesión social. Para mayor flexibilidad, también puedes usar tu propia cuenta de Privy y conectarla a VeChain Kit, permitiéndote usar métodos de inicio de sesión basados en OAuth2 como Google, Apple, Twitter, GitHub, etc. y personalizar completamente la experiencia de inicio de sesión.",
    "Yes. You need to use the kit's own hooks (useSendTransaction and useSignMessage) to support all login methods. And, to fully customize the login experience, you need to open your own Privy account, since with the shared VeChain + Privy integration you cannot target only specific social login methods and users' signatures are always requested when doing transactions.": "Sí. Debes usar los hooks propios del kit (useSendTransaction y useSignMessage) para soportar todos los métodos de inicio de sesión. Y, para personalizar completamente la experiencia de inicio de sesión, necesitas abrir tu propia cuenta de Privy, ya que con la integración compartida de VeChain + Privy no puedes seleccionar solo métodos sociales específicos y siempre se solicita la firma de los usuarios al realizar transacciones.",
    "and more...": "y más...",
    "Start building your new app now": "Comienza a construir tu nueva aplicación ahora",
    "Only one command to setup": "solo un comando para configurar",
    "Includes VeChain Kit, Chakra UI, React Query, SDK and more": "Incluye VeChain Kit, Chakra UI, React Query, SDK y más",
    "Copy command": "Copiar comando"
}
