{
  "Apps Built with VeChain Kit": "Applications créées avec VeChain Kit",
  "Boosted Development": "Développement accéléré",
  "Build on VeChain, effortlessly": "Développez sur VeChain, sans effort",
  "By developers, for developers.": "Par des développeurs, pour des développeurs.",
  "Can I customize the login methods shown to users?": "Puis-je personnaliser les méthodes de connexion affichées aux utilisateurs ?",
  "Choose from a wide variety of login methods to suit your users' preferences. Support for VeWorld, WalletConnect, social logins (Google, Apple, Twitter, GitHub), passkeys, and more. Give your users the flexibility they need.": "Choisissez parmi une grande variété de méthodes de connexion pour répondre aux préférences de vos utilisateurs. Prise en charge de VeWorld, WalletConnect, des connexions sociales (Google, Apple, Twitter, GitHub), des identifiants de sécurité (passkeys) et plus encore. Offrez à vos utilisateurs la flexibilité dont ils ont besoin.",
  "Color, fonts, background color, etc. You can create your own login button, and modal or use the provided one. You can decide to show or not the wallet or transaction modal, or show only specific contents (Send, Receive, Assets, Profile, etc.).": "Couleurs, polices, couleur d’arrière-plan, etc. Vous pouvez créer votre propre bouton de connexion et modal ou utiliser celui fourni. Vous pouvez décider d’afficher ou non la fenêtre du portefeuille ou des transactions, ou d’afficher uniquement certains contenus (Envoyer, Recevoir, Actifs, Profil, etc.).",
  "Customizable": "Personnalisable",
  "DAO": "DAO",
  "DeFi": "DeFi",
  "Demo text to be translated": "Texte de démonstration à traduire",
  "Discover all the possible ways to use the VeChain Kit to build your next dApp.": "Découvrez toutes les façons possibles d’utiliser le VeChain Kit pour créer votre prochaine dApp.",
  "Energy": "Énergie",
  "Forget about the underlying blockchain infrastructure. We handle it for you.": "Oubliez l’infrastructure blockchain sous-jacente. Nous nous en occupons pour vous.",
  "Frequently Asked Questions": "Foire aux questions",
  "Gaming": "Jeu",
  "Get Started Now": "Commencez maintenant",
  "Is the kit free to use?": "Le kit est-il gratuit à utiliser ?",
  "Login Methods": "Méthodes de connexion",
  "Login methods": "Méthodes de connexion",
  "Multi-language": "Multilingue",
  "Multiple language support": "Prise en charge de plusieurs langues",
  "Out of the box": "Prêt à l'emploi",
  "Staking": "Staking",
  "Sustainability": "Durabilité",
  "The VeChain Kit is a fantastic foundation for building on VeChain, especially with its clean hooks and UI components.": "Le VeChain Kit est une base fantastique pour développer sur VeChain, notamment grâce à ses hooks clairs et ses composants UI.",
  "The kit is designed to be customizable to your needs. Decide what features you want to use and which ones you don't. Add call-to-action buttons to your app to guide your users to the features they need.": "Le kit est conçu pour être personnalisable selon vos besoins. Décidez des fonctionnalités que vous souhaitez utiliser et de celles que vous ne souhaitez pas. Ajoutez des boutons d'appel à l'action à votre application pour guider vos utilisateurs vers les fonctionnalités dont ils ont besoin.",
  "The kit supports Next.js and React.": "Le kit prend en charge Next.js et React.",
  "The kit supports multiple languages out of the box allowing bidirectional sync between the kit and the host app.": "Le kit prend en charge plusieurs langues de manière native, permettant une synchronisation bidirectionnelle entre le kit et l'application hôte.",
  "The user pays for the transactions. However, if you want to sponsor them (always or only in specific scenarios), you can use the fee delegation feature.": "L'utilisateur paie les transactions. Cependant, si vous souhaitez les sponsoriser (toujours ou seulement dans certains scénarios), vous pouvez utiliser la fonctionnalité de délégation des frais.",
  "To support all login methods, you need to use the kit's own hooks (useSendTransaction and useSignMessage). To fully customize the login experience, you need to use your own Privy account. The VeChain shared Privy integration has some limitations: you cannot target only specific social login methods, you cannot fully customize the login UX (users will need to go through a popup window), and users' signatures are always requested when doing transactions.": "Pour prendre en charge toutes les méthodes de connexion, vous devez utiliser les hooks du kit (useSendTransaction et useSignMessage). Pour personnaliser entièrement l'expérience de connexion, vous devez utiliser votre propre compte Privy. L'intégration Privy partagée de VeChain présente certaines limitations : vous ne pouvez pas cibler uniquement certaines méthodes de connexion sociale, vous ne pouvez pas personnaliser entièrement l’UX de connexion (les utilisateurs devront passer par une fenêtre popup), et la signature des utilisateurs est toujours demandée lors des transactions.",
  "Trading": "Trading",
  "Use our hooks and components to speed up your development and interact with the blockchain.": "Utilisez nos hooks et composants pour accélérer votre développement et interagir avec la blockchain.",
  "VeChain Kit": "VeChain Kit",
  "VeChain Kit is an all-in-one SDK for building frontend applications on VeChain blockchain, supporting wallet integration, developer hooks, pre-built UI components, and more.": "VeChain Kit est un SDK tout-en-un pour créer des applications frontend sur la blockchain VeChain, prenant en charge l'intégration de wallets, des hooks pour développeurs, des composants UI pré-construits, et bien plus.",
  "Version 2 has been released!": "La version 2 est sortie !",
  "View Release Notes": "Voir les notes de version",
  "Visit": "Visiter",
  "What are the limitations?": "Quelles sont les limitations ?",
  "What are the supported frameworks?": "Quels sont les frameworks pris en charge ?",
  "What can I customize?": "Que puis-je personnaliser ?",
  "Who pays for the transactions?": "Qui paie les transactions ?",
  "Yes. VeChain Kit is free to use. If you want full control over the login experience, you can connect your own Privy account (Privy pricing applies). If you use the shared VeChain + Privy integration, you don't pay anything to get started.": "Oui. VeChain Kit est gratuit à utiliser. Si vous souhaitez un contrôle total sur l’expérience de connexion, vous pouvez connecter votre propre compte Privy (tarification Privy s’applique). Si vous utilisez l’intégration partagée VeChain + Privy, vous ne payez rien pour commencer.",
  "Yes. You can decide to use only veworld, or only social login methods. To maximize flexibility, you can also use your own Privy account and connect it to VeChain Kit, allowing you to use OAuth2-based login methods like Google, Apple, Twitter, GitHub, etc. and completely customize the login experience.": "Oui. Vous pouvez choisir d’utiliser uniquement veworld ou seulement les méthodes de connexion sociale. Pour plus de flexibilité, vous pouvez aussi utiliser votre propre compte Privy et le connecter à VeChain Kit, ce qui vous permet d’utiliser des méthodes de connexion basées sur OAuth2 comme Google, Apple, Twitter, GitHub, etc. et de personnaliser entièrement l’expérience de connexion.",
  "and more...": "et plus encore...",
  "• Lightweight integration for social login.\n• Uses the login and wallet modals.": "• Intégration légère pour la connexion sociale.\n• Utilise les modales de connexion et de portefeuille.",
  "• Supports VeWorld, WalletConnect, and Sync2 wallets (only).\n• VeChain Kit UI is fully integrated into the app.\n• Uses VeChain Kit hooks for transaction management.\n• Uses custom transaction flows and components.": "• Prend en charge uniquement les portefeuilles VeWorld, WalletConnect et Sync2.\n• L'interface VeChain Kit est entièrement intégrée à l’application.\n• Utilise les hooks VeChain Kit pour la gestion des transactions.\n• Utilise des flux et composants de transaction personnalisés.",
  "• Supports all login methods.\n• Uses the login and wallet modals.\n• Uses VeChain Kit hooks for transaction management.\n• Uses custom transaction flows and components.": "• Prend en charge toutes les méthodes de connexion.\n• Utilise les modales de connexion et de portefeuille.\n• Utilise les hooks VeChain Kit pour la gestion des transactions.\n• Utilise des flux et composants de transaction personnalisés.",
  "• Supports all login methods.\n• VeChain Kit UI is fully integrated into the app.\n• Uses a bottom sheet UX on mobile.\n• Uses VeChain Kit hooks for transaction management.\n• Uses custom transaction flows and components.": "• Prend en charge toutes les méthodes de connexion.\n• L’interface VeChain Kit est entièrement intégrée à l’application.\n• Utilise une expérience utilisateur en bas de page sur mobile.\n• Utilise les hooks VeChain Kit pour la gestion des transactions.\n• Utilise des flux et composants de transaction personnalisés.",
  "• Uses VeChain Kit UI only for the \"Login\" screen.\n• Uses VeChain Kit hooks.": "• Utilise l’interface VeChain Kit uniquement pour l’écran « Connexion ».\n• Utilise les hooks VeChain Kit.",
  "• Uses VeChain Kit end-to-end: login, wallet, hooks, and transaction components.": "• Utilise VeChain Kit de bout en bout : connexion, portefeuille, hooks et composants de transaction.",
  "• Uses its own Privy setup.\n• Supports Google OAuth login and VeWorld login.\n• Implements custom login, wallet management, and transaction flows (no VeChain Kit UI).\n• Uses VeChain Kit UI only for the \"Receive\" and \"Send\" screens.\n• Uses VeChain Kit hooks for transaction management.": "• Utilise sa propre configuration Privy.\n• Prend en charge la connexion Google OAuth et VeWorld.\n• Implémente une connexion, une gestion de portefeuille et des flux de transaction personnalisés (pas d’interface VeChain Kit).\n• Utilise l’interface VeChain Kit uniquement pour les écrans « Recevoir » et « Envoyer ».\n• Utilise les hooks VeChain Kit pour la gestion des transactions."
}