{
  "Apps Built with VeChain Kit": "App create con VeChain Kit",
  "Are there any limitations?": "Ci sono delle limitazioni?",
  "Boosted Development": "Sviluppo Potenziato",
  "Build on VeChain, effortlessly": "Costruisci su VeChain, senza sforzo",
  "By developers, for developers.": "Da sviluppatori, per sviluppatori.",
  "Can I customize the login methods shown to users?": "Posso personalizzare i metodi di accesso mostrati agli utenti?",
  "Choose from a wide variety of login methods to suit your users' preferences. Support for VeWorld, WalletConnect, social logins (Google, Apple, Twitter, GitHub), passkeys, and more. Give your users the flexibility they need.": "Scegli tra una vasta gamma di metodi di accesso per adattarti alle preferenze dei tuoi utenti. Supporta VeWorld, WalletConnect, accessi social (Google, Apple, Twitter, GitHub), passkey e altro ancora. Dai ai tuoi utenti la flessibilità di cui hanno bisogno.",
  "Color, fonts, background color, etc. You can create your own login button, and modal or use the provided one. You can decide to show or not the wallet or transaction modal, or show only specific contents (Send, Receive, Assets, Profile, etc.).": "Colore, font, colore di sfondo, ecc. Puoi creare il tuo pulsante di accesso e la tua finestra modale oppure utilizzare quella fornita. Puoi decidere se mostrare o meno la finestra wallet o transazioni, oppure visualizzare solo contenuti specifici (Invia, Ricevi, Asset, Profilo, ecc.).",
  "Customizable": "Personalizzabile",
  "DAO": "DAO",
  "DeFi": "DeFi",
  "Demo text to be translated": "Testo dimostrativo da tradurre",
  "Discover all the possible ways to use the VeChain Kit to build your next dApp.": "Scopri tutti i modi possibili per utilizzare VeChain Kit nella creazione della tua prossima dApp.",
  "Energy": "Energia",
  "Forget about the underlying blockchain infrastructure. We handle it for you.": "Dimentica l'infrastruttura blockchain sottostante. Ce ne occupiamo noi.",
  "Frequently Asked Questions": "Domande Frequenti",
  "Gaming": "Gaming",
  "Get Started Now": "Inizia ora",
  "Is the kit free to use?": "Il kit è gratuito?",
  "Lightweight integration to allow social login users to use the platform and manage their energy assets.": "Integrazione leggera per consentire agli utenti con social login di utilizzare la piattaforma e gestire i propri asset energetici.",
  "Login Methods": "Metodi di Accesso",
  "Login methods": "Metodi di accesso",
  "Multi-language": "Multilingua",
  "Multiple language support": "Supporto multilingue",
  "Out of the box": "Pronto all'uso",
  "Staking": "Staking",
  "Supports only VeWorld, WalletConnect, and Sync2 wallets, and fully integrates VeChain Kit UI into the app to enhance the user experience Profile and Wallet modals.": "Supporta solo i wallet VeWorld, WalletConnect e Sync2, e integra completamente la VeChain Kit UI nell’app per migliorare l’esperienza utente nei modali di Profilo e Wallet.",
  "Sustainability": "Sostenibilità",
  "The VeChain Kit is a fantastic foundation for building on VeChain, especially with its clean hooks and UI components.": "VeChain Kit è una base fantastica per sviluppare su VeChain, soprattutto grazie ai suoi hook puliti e ai componenti UI.",
  "The kit is designed to be customizable to your needs. Decide what features you want to use and which ones you don't. Add call-to-action buttons to your app to guide your users to the features they need.": "Il kit è progettato per essere personalizzabile in base alle tue esigenze. Decidi quali funzionalità utilizzare e quali no. Aggiungi pulsanti call-to-action alla tua app per guidare i tuoi utenti verso le funzionalità di cui hanno bisogno.",
  "The kit supports Next.js and React.": "Il kit supporta Next.js e React.",
  "The kit supports multiple languages out of the box allowing bidirectional sync between the kit and the host app.": "Il kit supporta più lingue nativamente, consentendo una sincronizzazione bidirezionale tra il kit e l'app principale.",
  "The user pays for the transactions. However, if you want to sponsor them (always or only in specific scenarios), you can use the fee delegation feature.": "L'utente paga per le transazioni. Tuttavia, se desideri sponsorizzarle (sempre o solo in determinati scenari), puoi utilizzare la funzione di delega delle commissioni.",
  "To support all login methods, you need to use the kit's own hooks (useSendTransaction and useSignMessage). To fully customize the login experience, you need to use your own Privy account. The VeChain shared Privy integration has some limitations: you cannot target only specific social login methods, you cannot fully customize the login UX (users will need to go through a popup window), and users' signatures are always requested when doing transactions.": "Per supportare tutti i metodi di accesso, è necessario utilizzare gli hook del kit (useSendTransaction e useSignMessage). Per personalizzare completamente l'esperienza di login, devi usare il tuo account Privy. L'integrazione Privy condivisa di VeChain ha alcune limitazioni: non puoi selezionare solo determinati metodi di accesso social, non puoi personalizzare completamente l'esperienza di login (gli utenti dovranno passare attraverso una finestra popup) e la firma degli utenti viene sempre richiesta durante le transazioni.",
  "Trading": "Trading",
  "Try me!": "Prova mi!",
  "Use our hooks and components to speed up your development and interact with the blockchain.": "Utilizza i nostri hook e componenti per velocizzare lo sviluppo e interagire con la blockchain.",
  "Uses VeChain Kit end-to-end: login, wallet, hooks, and transaction components.": "Utilizza VeChain Kit end-to-end: login, wallet, hooks e componenti per le transazioni.",
  "Uses VeChain Kit only for the login flow and for the hooks to manage transactions.": "Utilizza VeChain Kit solo per il flusso di login e per i hooks di gestione delle transazioni.",
  "Uses VeChain Kit to allow social login users to trade on the platform.": "Utilizza VeChain Kit per consentire agli utenti con social login di effettuare transazioni sulla piattaforma.",
  "Uses its own Privy setup for social login OAuth2 based methods like Google and Apple": "Utilizza una propria configurazione Privy per i metodi di social login basati su OAuth2 come Google e Apple.",
  "VeChain Kit": "VeChain Kit",
  "VeChain Kit UI is fully integrated into the app, using a bottom sheet UX on mobile to enhance the user experience.": "La VeChain Kit UI è completamente integrata nell’app, utilizzando una bottom sheet UX su mobile per migliorare l’esperienza utente.",
  "VeChain Kit is an all-in-one SDK for building frontend applications on VeChain blockchain, supporting wallet integration, developer hooks, pre-built UI components, and more.": "VeChain Kit è un SDK all-in-one per sviluppare applicazioni frontend su blockchain VeChain, supportando l'integrazione wallet, hook per sviluppatori, componenti UI predefiniti e altro ancora.",
  "Version 2 has been released!": "La versione 2 è stata rilasciata!",
  "View Release Notes": "Visualizza le note di rilascio",
  "Visit": "Visita",
  "What are the limitations?": "Quali sono le limitazioni?",
  "What are the supported frameworks?": "Quali sono i framework supportati?",
  "What can I customize?": "Cosa posso personalizzare?",
  "Who pays for the transactions?": "Chi paga per le transazioni?",
  "Yes. VeChain Kit is free to use. If you want full control over the login experience, you can connect your own Privy account (Privy pricing applies). If you use the shared VeChain + Privy integration, you don't pay anything to get started.": "Sì. VeChain Kit è gratuito. Se desideri il pieno controllo sull'esperienza di login, puoi collegare il tuo account Privy (si applicano i costi Privy). Se utilizzi l'integrazione condivisa VeChain + Privy, non paghi nulla per iniziare.",
  "Yes. You can decide to use only veworld, or only social login methods. To maximize flexibility, you can also use your own Privy account and connect it to VeChain Kit, allowing you to use OAuth2-based login methods like Google, Apple, Twitter, GitHub, etc. and completely customize the login experience.": "Sì. Puoi decidere di utilizzare solo veworld o solo metodi di login social. Per massimizzare la flessibilità, puoi anche utilizzare il tuo account Privy e collegarlo a VeChain Kit, permettendoti di usare metodi di login basati su OAuth2 come Google, Apple, Twitter, GitHub, ecc. e personalizzare completamente l'esperienza di accesso.",
  "Yes. You need to use the kit's own hooks (useSendTransaction and useSignMessage) to support all login methods. And, to fully customize the login experience, you need to open your own Privy account, since with the shared VeChain + Privy integration you cannot target only specific social login methods and users' signatures are always requested when doing transactions.": "Sì. È necessario utilizzare i propri hooks del kit (useSendTransaction e useSignMessage) per supportare tutti i metodi di login. Inoltre, per personalizzare completamente l’esperienza di login, occorre aprire un proprio account Privy, poiché con l’integrazione condivisa VeChain + Privy non è possibile selezionare solo specifici metodi di social login e la firma degli utenti viene sempre richiesta durante le transazioni.",
  "and more...": "e altro ancora..."
}