{
  "Apps Built with VeChain Kit": "VeChain Kitで開発されたアプリ",
  "Are there any limitations?": "制限はありますか？",
  "Boosted Development": "開発の加速",
  "Build on VeChain, effortlessly": "簡単にVeChain上で構築",
  "By developers, for developers.": "開発者による、開発者のための。",
  "Can I customize the login methods shown to users?": "ユーザーに表示されるログイン方法をカスタマイズできますか？",
  "Choose from a wide variety of login methods to suit your users' preferences. Support for VeWorld, WalletConnect, social logins (Google, Apple, Twitter, GitHub), passkeys, and more. Give your users the flexibility they need.": "ユーザーの好みに合わせて様々なログイン方法から選択できます。VeWorld、WalletConnect、ソーシャルログイン（Google、Apple、Twitter、GitHub）、パスキーなどに対応。ユーザーに必要な柔軟性を提供します。",
  "Color, fonts, background color, etc. You can create your own login button, and modal or use the provided one. You can decide to show or not the wallet or transaction modal, or show only specific contents (Send, Receive, Assets, Profile, etc.).": "色、フォント、背景色などをカスタマイズ可能です。独自のログインボタンやモーダルを作成することも、用意されたものを使うこともできます。ウォレットまたはトランザクションモーダルを表示するかどうかや、特定のコンテンツ（送信、受信、資産、プロフィールなど）だけを表示することも可能です。",
  "Customizable": "カスタマイズ可能",
  "DAO": "DAO",
  "DeFi": "DeFi（分散型金融）",
  "Demo text to be translated": "翻訳するデモテキスト",
  "Discover all the possible ways to use the VeChain Kit to build your next dApp.": "VeChain Kitを使って次のdAppを開発するための様々な方法を見つけましょう。",
  "Energy": "エネルギー",
  "Forget about the underlying blockchain infrastructure. We handle it for you.": "ブロックチェーンのインフラについて心配する必要はありません。私たちが対応します。",
  "Frequently Asked Questions": "よくある質問",
  "Gaming": "ゲーム",
  "Get Started Now": "今すぐ始める",
  "Is the kit free to use?": "このキットは無料で使えますか？",
  "Lightweight integration to allow social login users to use the platform and manage their energy assets.": "ソーシャルログインユーザーがプラットフォームを利用し、エネルギー資産を管理できる軽量な統合です。",
  "Login Methods": "ログイン方法",
  "Login methods": "ログイン方法",
  "Multi-language": "多言語",
  "Multiple language support": "複数言語のサポート",
  "Out of the box": "すぐに使える",
  "Staking": "ステーキング",
  "Supports only VeWorld, WalletConnect, and Sync2 wallets, and fully integrates VeChain Kit UI into the app to enhance the user experience Profile and Wallet modals.": "VeWorld、WalletConnect、Sync2ウォレットのみをサポートし、VeChain Kit UIをアプリ内に完全統合することで、ユーザー体験の向上やプロフィール・ウォレットモーダルを実現します。",
  "Sustainability": "サステナビリティ",
  "The VeChain Kit is a fantastic foundation for building on VeChain, especially with its clean hooks and UI components.": "VeChain Kitは、特にクリーンなフックやUIコンポーネントが特徴で、VeChain上での開発に最適な基盤です。",
  "The kit is designed to be customizable to your needs. Decide what features you want to use and which ones you don't. Add call-to-action buttons to your app to guide your users to the features they need.": "このキットは、ニーズに合わせてカスタマイズ可能な設計となっています。使用したい機能・不要な機能を選択し、ユーザーが必要な機能にアクセスできるよう、アプリにコールトゥアクションボタンを追加できます。",
  "The kit supports Next.js and React.": "このキットはNext.jsとReactをサポートしています。",
  "The kit supports multiple languages out of the box allowing bidirectional sync between the kit and the host app.": "このキットは複数言語に対応しており、ホストアプリとキット間の双方向同期が可能です。",
  "The user pays for the transactions. However, if you want to sponsor them (always or only in specific scenarios), you can use the fee delegation feature.": "ユーザーがトランザクションの手数料を支払いますが、常にまたは特定の状況でユーザーの手数料を肩代わりしたい場合は、フィー・デリゲーション機能を利用できます。",
  "To support all login methods, you need to use the kit's own hooks (useSendTransaction and useSignMessage). To fully customize the login experience, you need to use your own Privy account. The VeChain shared Privy integration has some limitations: you cannot target only specific social login methods, you cannot fully customize the login UX (users will need to go through a popup window), and users' signatures are always requested when doing transactions.": "すべてのログイン方法をサポートするには、キット独自のフック（useSendTransactionおよびuseSignMessage）を使用する必要があります。ログイン体験を完全にカスタマイズするには、ご自身のPrivyアカウントを使用してください。VeChainの共有Privy統合にはいくつか制限があり、特定のソーシャルログイン方法だけを指定できない、ログインUXを完全にはカスタマイズできない（ユーザーはポップアップウィンドウを経由する必要がある）、トランザクション時には必ず署名要求が発生するといった点があります。",
  "Trading": "トレーディング",
  "Try me!": "試してみて！",
  "Use our hooks and components to speed up your development and interact with the blockchain.": "当社のフックやコンポーネントを活用して、開発のスピードアップやブロックチェーンとのやり取りが可能です。",
  "Uses VeChain Kit end-to-end: login, wallet, hooks, and transaction components.": "VeChain Kitをエンドツーエンドで使用：ログイン、ウォレット、フック、トランザクションコンポーネント。",
  "Uses VeChain Kit only for the login flow and for the hooks to manage transactions.": "VeChain Kitはログインフローと、トランザクション管理用フックのみに使用します。",
  "Uses VeChain Kit to allow social login users to trade on the platform.": "ソーシャルログインユーザーがプラットフォーム上で取引できるよう、VeChain Kitを使用します。",
  "Uses its own Privy setup for social login OAuth2 based methods like Google and Apple": "GoogleやAppleなどのOAuth2ベースのソーシャルログインを利用するため、独自のPrivy設定を使用します。",
  "VeChain Kit": "VeChain Kit",
  "VeChain Kit UI is fully integrated into the app, using a bottom sheet UX on mobile to enhance the user experience.": "VeChain Kit UIはアプリに完全統合されており、モバイルではボトムシートUXを採用してユーザー体験を向上させています。",
  "VeChain Kit is an all-in-one SDK for building frontend applications on VeChain blockchain, supporting wallet integration, developer hooks, pre-built UI components, and more.": "VeChain Kitは、ウォレット統合、開発者向けフック、事前構築済みUIコンポーネントなどをサポートする、VeChainブロックチェーン上のフロントエンドアプリケーション構築用オールインワンSDKです。",
  "Version 2 has been released!": "バージョン2がリリースされました！",
  "View Release Notes": "リリースノートを見る",
  "Visit": "訪問する",
  "What are the limitations?": "制限事項は何ですか？",
  "What are the supported frameworks?": "対応しているフレームワークは何ですか？",
  "What can I customize?": "何をカスタマイズできますか？",
  "Who pays for the transactions?": "トランザクションの費用は誰が支払いますか？",
  "Yes. VeChain Kit is free to use. If you want full control over the login experience, you can connect your own Privy account (Privy pricing applies). If you use the shared VeChain + Privy integration, you don't pay anything to get started.": "はい。VeChain Kitは無料でご利用いただけます。ログイン体験を完全にコントロールしたい場合は、ご自身のPrivyアカウントを接続できます（Privyの料金が適用されます）。共有のVeChain + Privyインテグレーションを使用する場合は、初期費用なしで始められます。",
  "Yes. You can decide to use only veworld, or only social login methods. To maximize flexibility, you can also use your own Privy account and connect it to VeChain Kit, allowing you to use OAuth2-based login methods like Google, Apple, Twitter, GitHub, etc. and completely customize the login experience.": "はい。veworldだけ、もしくはソーシャルログインのみを利用することもできます。柔軟性を最大化するために、ご自身のPrivyアカウントをVeChain Kitに接続し、Google、Apple、Twitter、GitHubなどのOAuth2ベースのログイン方法を使用し、ログイン体験を完全にカスタマイズすることも可能です。",
  "Yes. You need to use the kit's own hooks (useSendTransaction and useSignMessage) to support all login methods. And, to fully customize the login experience, you need to open your own Privy account, since with the shared VeChain + Privy integration you cannot target only specific social login methods and users' signatures are always requested when doing transactions.": "はい。すべてのログイン方法に対応するためには、キット専用のフック（useSendTransactionやuseSignMessage）を使用する必要があります。また、ログイン体験を完全にカスタマイズするには独自のPrivyアカウントを開設する必要があります。なぜなら、共有されたVeChain＋Privy連携の場合、特定のソーシャルログイン方法だけを指定することができず、すべての取引でユーザー署名が常に求められるためです。",
  "and more...": "その他にも..."
}