{
  "Apps Built with VeChain Kit": "使用 VeChain Kit 构建的应用",
  "Boosted Development": "加速开发",
  "Build on VeChain, effortlessly": "轻松构建于 VeChain",
  "By developers, for developers.": "由开发者为开发者打造。",
  "Can I customize the login methods shown to users?": "我可以自定义显示给用户的登录方式吗？",
  "Choose from a wide variety of login methods to suit your users' preferences. Support for VeWorld, WalletConnect, social logins (Google, Apple, Twitter, GitHub), passkeys, and more. Give your users the flexibility they need.": "从多种登录方式中选择，满足用户的不同需求。支持 VeWorld、WalletConnect、社交登录（Google、Apple、Twitter、GitHub）、通行密钥等，为用户提供所需的灵活性。",
  "Color, fonts, background color, etc. You can create your own login button, and modal or use the provided one. You can decide to show or not the wallet or transaction modal, or show only specific contents (Send, Receive, Assets, Profile, etc.).": "颜色、字体、背景色等都可自定义。你可以创建自己的登录按钮和弹窗，也可以使用默认提供的。你还可以决定是否显示钱包或交易弹窗，或仅显示特定内容（发送、接收、资产、个人资料等）。",
  "Customizable": "可自定义",
  "DAO": "DAO",
  "DeFi": "DeFi",
  "Demo text to be translated": "待翻译的演示文本",
  "Discover all the possible ways to use the VeChain Kit to build your next dApp.": "探索使用 VeChain Kit 构建下一个 dApp 的各种可能方式。",
  "Energy": "能源",
  "Forget about the underlying blockchain infrastructure. We handle it for you.": "忘记底层区块链架构吧，我们为你处理一切。",
  "Frequently Asked Questions": "常见问题",
  "Gaming": "游戏",
  "Get Started Now": "立即开始",
  "Is the kit free to use?": "这个工具包可以免费使用吗？",
  "Login Methods": "登录方式",
  "Login methods": "登录方式",
  "Multi-language": "多语言",
  "Multiple language support": "支持多种语言",
  "Out of the box": "开箱即用",
  "Staking": "质押",
  "Sustainability": "可持续性",
  "The VeChain Kit is a fantastic foundation for building on VeChain, especially with its clean hooks and UI components.": "VeChain Kit 是在 VeChain 上开发的极佳基础，尤其是它简洁的 hooks 和 UI 组件。",
  "The kit is designed to be customizable to your needs. Decide what features you want to use and which ones you don't. Add call-to-action buttons to your app to guide your users to the features they need.": "该工具包可根据你的需求进行自定义。你可以选择使用或不使用某些功能。通过在应用中添加行动按钮，引导用户使用他们所需的功能。",
  "The kit supports Next.js and React.": "该工具包支持 Next.js 和 React。",
  "The kit supports multiple languages out of the box allowing bidirectional sync between the kit and the host app.": "该工具包开箱即用地支持多语言，并可与主应用实现双向同步。",
  "The user pays for the transactions. However, if you want to sponsor them (always or only in specific scenarios), you can use the fee delegation feature.": "用户需要为交易支付费用。不过，如果你想为用户支付费用（始终或仅在特定场景下），可以使用手续费委托功能。",
  "To support all login methods, you need to use the kit's own hooks (useSendTransaction and useSignMessage). To fully customize the login experience, you need to use your own Privy account. The VeChain shared Privy integration has some limitations: you cannot target only specific social login methods, you cannot fully customize the login UX (users will need to go through a popup window), and users' signatures are always requested when doing transactions.": "为了支持所有登录方式，你需要使用工具包自带的 hooks（useSendTransaction 和 useSignMessage）。如需完全自定义登录体验，你需要配置自己的 Privy 账户。VeChain 共享的 Privy 集成存在一些限制：无法仅针对特定社交登录方式进行定制，无法完全自定义登录界面（用户需要通过弹窗进行登录），并且每次交易都需要请求用户签名。",
  "Trading": "交易",
  "Use our hooks and components to speed up your development and interact with the blockchain.": "使用我们的 hooks 和组件可以加快开发效率，并便捷地与区块链交互。",
  "VeChain Kit": "VeChain 工具包",
  "VeChain Kit is an all-in-one SDK for building frontend applications on VeChain blockchain, supporting wallet integration, developer hooks, pre-built UI components, and more.": "VeChain Kit 是一个用于在 VeChain 区块链上构建前端应用的全能 SDK，支持钱包集成、开发者 hooks、预构建的 UI 组件等功能。",
  "Version 2 has been released!": "2.0 版已发布！",
  "View Release Notes": "查看发布说明",
  "Visit": "访问",
  "What are the limitations?": "有哪些限制？",
  "What are the supported frameworks?": "支持哪些框架？",
  "What can I customize?": "我可以自定义哪些内容？",
  "Who pays for the transactions?": "谁来支付交易费用？",
  "Yes. VeChain Kit is free to use. If you want full control over the login experience, you can connect your own Privy account (Privy pricing applies). If you use the shared VeChain + Privy integration, you don't pay anything to get started.": "是的。VeChain Kit 可免费使用。如果你想完全控制登录体验，可以连接你自己的 Privy 账号（Privy 价格适用）。如果你使用共享的 VeChain + Privy 集成，则无需支付任何费用即可开始使用。",
  "Yes. You can decide to use only veworld, or only social login methods. To maximize flexibility, you can also use your own Privy account and connect it to VeChain Kit, allowing you to use OAuth2-based login methods like Google, Apple, Twitter, GitHub, etc. and completely customize the login experience.": "是的。你可以选择只使用 veworld，或只使用社交登录方式。为了最大程度的灵活性，你也可以使用自己的 Privy 账号并连接到 VeChain Kit，从而使用基于 OAuth2 的登录方式，如 Google、Apple、Twitter、GitHub 等，并且可以完全自定义登录体验。",
  "and more...": "以及更多……",
  "• Lightweight integration for social login.\n• Uses the login and wallet modals.": "• 轻量级集成社交登录。\n• 使用登录和钱包弹窗。",
  "• Supports VeWorld, WalletConnect, and Sync2 wallets (only).\n• VeChain Kit UI is fully integrated into the app.\n• Uses VeChain Kit hooks for transaction management.\n• Uses custom transaction flows and components.": "• 仅支持 VeWorld、WalletConnect 和 Sync2 钱包。\n• VeChain Kit UI 完全集成于应用中。\n• 使用 VeChain Kit 钩子进行交易管理。\n• 使用自定义交易流程和组件。",
  "• Supports all login methods.\n• Uses the login and wallet modals.\n• Uses VeChain Kit hooks for transaction management.\n• Uses custom transaction flows and components.": "• 支持所有登录方式。\n• 使用登录和钱包弹窗。\n• 使用 VeChain Kit 钩子进行交易管理。\n• 使用自定义交易流程和组件。",
  "• Supports all login methods.\n• VeChain Kit UI is fully integrated into the app.\n• Uses a bottom sheet UX on mobile.\n• Uses VeChain Kit hooks for transaction management.\n• Uses custom transaction flows and components.": "• 支持所有登录方式。\n• VeChain Kit UI 完全集成于应用中。\n• 在移动端使用底部弹窗体验。\n• 使用 VeChain Kit 钩子进行交易管理。\n• 使用自定义交易流程和组件。",
  "• Uses VeChain Kit UI only for the \"Login\" screen.\n• Uses VeChain Kit hooks.": "• 仅在“登录”界面使用 VeChain Kit UI。\n• 使用 VeChain Kit 钩子。",
  "• Uses VeChain Kit end-to-end: login, wallet, hooks, and transaction components.": "• 端到端使用 VeChain Kit：登录、钱包、钩子和交易组件。",
  "• Uses its own Privy setup.\n• Supports Google OAuth login and VeWorld login.\n• Implements custom login, wallet management, and transaction flows (no VeChain Kit UI).\n• Uses VeChain Kit UI only for the \"Receive\" and \"Send\" screens.\n• Uses VeChain Kit hooks for transaction management.": "• 使用自有 Privy 配置。\n• 支持 Google OAuth 登录和 VeWorld 登录。\n• 实现自定义登录、钱包管理和交易流程（无 VeChain Kit UI）。\n• 仅在“接收”和“发送”页面使用 VeChain Kit UI。\n• 使用 VeChain Kit 钩子进行交易管理。"
}